"use client";
import PostCard from "@/app/blogPosts/PostCard";
import FullPageSpinner from "@/components/ui/FullPageSpinner";
import { usePosts } from "@/react-query/posts/usePosts";
import { PostCardType } from "@/types/postType";
import React from "react";
import toast from "react-hot-toast";

// const posts: PostCardType[] = [
//   {
//     id: 254,
//     date: "2024-05-05T07:35:57",
//     date_gmt: "2024-05-05T07:35:57",
//     modified: "2024-05-05T07:37:40",
//     modified_gmt: "2024-05-05T07:37:40",
//     slug: "article-copy-10",
//     status: "publish",
//     type: "post",
//     title: "عنوان بلاگ در این قسمت نوشته شود و ممکن است دو سطری باشد.",

//     content: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\n",
//       protected: false,
//     },
//     excerpt: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه [&hellip;]</p>\n",
//       protected: false,
//     },
//     categories: [
//       {
//         id: 1,
//         name: "دسته اخبار",
//         slug: "news-cat",
//       },
//     ],
//     featured_media_object: {
//       id: 131,
//       title: "card-3",
//       caption: "",
//       description: "",
//       media_details: {
//         width: 421,
//         height: 247,
//         filesize: 8174,
//       },
//       source_url:
//         "https://nabsteel.rahkartest.ir/wp-content/uploads/2024/04/card-3.webp",
//     },
//   },
//   {
//     id: 254,
//     date: "2024-05-05T07:35:57",
//     date_gmt: "2024-05-05T07:35:57",
//     modified: "2024-05-05T07:37:40",
//     modified_gmt: "2024-05-05T07:37:40",
//     slug: "article-copy-10",
//     status: "publish",
//     type: "post",
//     title: "عنوان بلاگ در این قسمت نوشته شود و ممکن است دو سطری باشد.",

//     content: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\n",
//       protected: false,
//     },
//     excerpt: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه [&hellip;]</p>\n",
//       protected: false,
//     },
//     categories: [
//       {
//         id: 1,
//         name: "دسته اخبار",
//         slug: "news-cat",
//       },
//     ],
//     featured_media_object: {
//       id: 131,
//       title: "card-3",
//       caption: "",
//       description: "",
//       media_details: {
//         width: 421,
//         height: 247,
//         filesize: 8174,
//       },
//       source_url:
//         "https://nabsteel.rahkartest.ir/wp-content/uploads/2024/04/card-3.webp",
//     },
//   },
//   {
//     id: 254,
//     date: "2024-05-05T07:35:57",
//     date_gmt: "2024-05-05T07:35:57",
//     modified: "2024-05-05T07:37:40",
//     modified_gmt: "2024-05-05T07:37:40",
//     slug: "article-copy-10",
//     status: "publish",
//     type: "post",
//     title: "عنوان بلاگ در این قسمت نوشته شود و ممکن است دو سطری باشد.",

//     content: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\n",
//       protected: false,
//     },
//     excerpt: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه [&hellip;]</p>\n",
//       protected: false,
//     },
//     categories: [
//       {
//         id: 1,
//         name: "دسته اخبار",
//         slug: "news-cat",
//       },
//     ],
//     featured_media_object: {
//       id: 131,
//       title: "card-3",
//       caption: "",
//       description: "",
//       media_details: {
//         width: 421,
//         height: 247,
//         filesize: 8174,
//       },
//       source_url:
//         "https://nabsteel.rahkartest.ir/wp-content/uploads/2024/04/card-3.webp",
//     },
//   },
//   {
//     id: 254,
//     date: "2024-05-05T07:35:57",
//     date_gmt: "2024-05-05T07:35:57",
//     modified: "2024-05-05T07:37:40",
//     modified_gmt: "2024-05-05T07:37:40",
//     slug: "article-copy-10",
//     status: "publish",
//     type: "post",
//     title: "عنوان بلاگ در این قسمت نوشته شود و ممکن است دو سطری باشد.",

//     content: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\n",
//       protected: false,
//     },
//     excerpt: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه [&hellip;]</p>\n",
//       protected: false,
//     },
//     categories: [
//       {
//         id: 1,
//         name: "دسته اخبار",
//         slug: "news-cat",
//       },
//     ],
//     featured_media_object: {
//       id: 131,
//       title: "card-3",
//       caption: "",
//       description: "",
//       media_details: {
//         width: 421,
//         height: 247,
//         filesize: 8174,
//       },
//       source_url:
//         "https://nabsteel.rahkartest.ir/wp-content/uploads/2024/04/card-3.webp",
//     },
//   },
//   {
//     id: 254,
//     date: "2024-05-05T07:35:57",
//     date_gmt: "2024-05-05T07:35:57",
//     modified: "2024-05-05T07:37:40",
//     modified_gmt: "2024-05-05T07:37:40",
//     slug: "article-copy-10",
//     status: "publish",
//     type: "post",
//     title: "عنوان بلاگ در این قسمت نوشته شود و ممکن است دو سطری باشد.",

//     content: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\n",
//       protected: false,
//     },
//     excerpt: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه [&hellip;]</p>\n",
//       protected: false,
//     },
//     categories: [
//       {
//         id: 1,
//         name: "دسته اخبار",
//         slug: "news-cat",
//       },
//     ],
//     featured_media_object: {
//       id: 131,
//       title: "card-3",
//       caption: "",
//       description: "",
//       media_details: {
//         width: 421,
//         height: 247,
//         filesize: 8174,
//       },
//       source_url:
//         "https://nabsteel.rahkartest.ir/wp-content/uploads/2024/04/card-3.webp",
//     },
//   },
//   {
//     id: 254,
//     date: "2024-05-05T07:35:57",
//     date_gmt: "2024-05-05T07:35:57",
//     modified: "2024-05-05T07:37:40",
//     modified_gmt: "2024-05-05T07:37:40",
//     slug: "article-copy-10",
//     status: "publish",
//     type: "post",
//     title: "عنوان بلاگ در این قسمت نوشته شود و ممکن است دو سطری باشد.",

//     content: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>\n",
//       protected: false,
//     },
//     excerpt: {
//       rendered:
//         "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه [&hellip;]</p>\n",
//       protected: false,
//     },
//     categories: [
//       {
//         id: 1,
//         name: "دسته اخبار",
//         slug: "news-cat",
//       },
//     ],
//     featured_media_object: {
//       id: 131,
//       title: "card-3",
//       caption: "",
//       description: "",
//       media_details: {
//         width: 421,
//         height: 247,
//         filesize: 8174,
//       },
//       source_url:
//         "https://nabsteel.rahkartest.ir/wp-content/uploads/2024/04/card-3.webp",
//     },
//   },
// ];

const Posts = () => {
  const { posts, isLoadingPosts, error } = usePosts();

  if (isLoadingPosts) return <FullPageSpinner />;

  if (error) {
    toast.error("لطفا اتصال اینترنتی خود را چک کنید.");
  }

  return (
    <div className="text-white grid grid-cols-1 sm:grid-cols-2 lg:grid-cols-3 gap-11 p-5">
      {posts?.map((post: PostCardType) => (
        <PostCard postCard={post} key={post.id} />
      ))}
    </div>
  );
};

export default Posts;
